tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Emacs dependency management
brew "cask"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Audio and video processing tools
brew "libav"
# Text-to-HTML conversion tool
brew "markdown"
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Manipulate and query tags on Mavericks files
brew "tag"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
cask "spotify"
